In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

### Empty dataframe

In [2]:
df = pd.DataFrame()
print( df.info() )
print( df.shape )

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrameNone
(0, 0)

### Add series

In [3]:
df["make"] = pd.Series( [ "honda", "chevy", "ford", "ferrari" ] )
df

      make
0    honda
1    chevy
2     ford
3  ferrari

In [4]:
df["cost"] = pd.Series( [20000, 10000, 15000, 100000] )
df["gas mileage"] = pd.Series( [30.0, 24.0, 25.0, 15.0] )
df["weight"] = pd.Series( [2000, 3000, 3500, 2500] )
df

      make    cost  gas mileage  weight
0    honda   20000         30.0    2000
1    chevy   10000         24.0    3000
2     ford   15000         25.0    3500
3  ferrari  100000         15.0    2500

### Remove a series

In [5]:
df.drop( ["cost","gas mileage"], axis=1, inplace=True )
df

      make  weight
0    honda    2000
1    chevy    3000
2     ford    3500
3  ferrari    2500

In [6]:
df.shape

(4, 2)

In [7]:
df.drop( range(0,2), inplace=True )
df.reset_index( drop=True, inplace=True)
df

      make  weight
0     ford    3500
1  ferrari    2500

### Set value

In [8]:
df.at[0, "weight"] = 3800
df

      make  weight
0     ford    3800
1  ferrari    2500

In [9]:
df.set_index("make", inplace=True )
df

         weight
make
ford       3800
ferrari    2500

In [10]:
df.at["ferrari", "weight"] = 2550
df

         weight
make
ford       3800
ferrari    2550

In [11]:
df.at["ford", "cost"] = 15000
df.at["ferrari", "cost"] = 100000
df

         weight      cost
make
ford       3800   15000.0
ferrari    2550  100000.0

In [12]:
df.loc[ df["cost"] > 20000 ]

         weight      cost
make
ferrari    2550  100000.0